app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends"
---
  def index
    friends = Friend.all

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    friend = Friend.find(params[:id])

INSERT INTO "friends" ("name", "species", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    friend = Friend.new(name:params[:name],species:params[:species],description:params[:description])
    friend.save

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "friends" SET "likes" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["likes", 1], ["updated_at", "2019-11-22 16:28:43.954428"], ["id", 1]]
INSERT INTO "comments" ("content", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "h.enEDHUHTEON"], ["friend_id", 1], ["created_at", "2019-11-22 16:28:49.873976"], ["updated_at", "2019-11-22 16:28:49.873976"]]
---
  def update
    friend = Friend.find(params[:id])
    if params[:likes]
      friend.likes += 1
      friend.save
    elsif params[:comment]
      friend.comments.create(content:params[:comment])